app/controllers/books_controller.rb

  def create
    @book = Book.create(title: params[:title], body: params[:body])
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Ruby"], ["body", "初心者"], ["created_at", "2020-12-10 03:25:35.781613"], ["updated_at", "2020-12-10 03:25:35.781613"]]

  def update
    @book = Book.find(params[:id])
    @book.update(title: params[:title], body: params[:body])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Ruby"], ["body", "初心者向け"], ["updated_at", "2020-12-11 06:48:32.733036"], ["id", 4]]

  def destroy
    @book = Book.find(params[:id])
    if @book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 6]]