app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "山本"], ["created_at", "2020-12-08 17:46:56.942139"], ["updated_at", "2020-12-08 17:46:56.942139"]]
---
  def create
    @user = User.create(name: params[:name])